using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Diploma
{
    class Issled
    {
        //имя исследования
        string name;
        //id исследования
        byte id;
        //массив вероятностей исследования
        private double[][,] probarray = new double[18][,]
        {
            //массив значений для подсчета кумулятивной вероятности
                new double[7,2] { {0.014, 3}, {0.043, 1}, {0.057, 1}, {0.100, 1}, {0.157, 1}, {0.186, 1}, {0.414, 1} },//ПТИ
                new double[7,2] { {0.014, 3}, {0.043, 1}, {0.057, 1}, {0.100, 1}, {0.214, 1}, {0.229, 1}, {0.271, 1} },//К, Na
                new double[9,2] { {0.014, 2}, {0.043, 1}, {0.057, 1}, {0.071, 1}, {0.114, 1}, {0.143, 1}, {0.157, 1}, {0.186, 1}, {0.200, 1} },//СРБ,АСО
                new double[7,2] { {0.014, 3}, {0.029, 1}, {0.057, 1}, {0.086, 1}, {0.143, 1}, {0.200, 2}, {0.243, 1} },//Глюкоза
                new double[8,2] { {0.014, 2}, {0.029, 1}, {0.043, 1}, {0.129, 1}, {0.143, 1}, {0.157, 1}, {0.200, 1}, {0.271, 1} },//Холестерин
                new double[7,2] { {0.014, 2}, {0.057, 1}, {0.071, 1}, {0.100, 1}, {0.129, 2}, {0.143, 2}, {0.200, 1} },//Тимоловая
                new double[5,2] { {0.029, 2}, {0.057, 2}, {0.114, 1}, {0.157, 2}, {0.200, 2} },//Мочев,креат
                new double[8,2] { {0.014, 1}, {0.029, 1}, {0.043, 1}, {0.057, 1}, {0.071, 1}, {0.143, 1}, {0.157, 3}, {0.171, 1} },//Общ бел
                new double[7,2] { {0.014, 1}, {0.029, 2}, {0.071, 1}, {0.100, 2}, {0.114, 1}, {0.157, 2}, {0.229, 1} },//Fe,жсс
                //
                new double[7,2] { {0.014, 3}, {0.043, 1}, {0.057, 1}, {0.100, 1}, {0.157, 1}, {0.186, 1}, {0.414, 1} },
                new double[7,2] { {0.014, 3}, {0.043, 1}, {0.057, 1}, {0.100, 1}, {0.157, 1}, {0.186, 1}, {0.414, 1} },
                new double[7,2] { {0.014, 3}, {0.043, 1}, {0.057, 1}, {0.100, 1}, {0.157, 1}, {0.186, 1}, {0.414, 1} },
                new double[7,2] { {0.014, 3}, {0.043, 1}, {0.057, 1}, {0.100, 1}, {0.157, 1}, {0.186, 1}, {0.414, 1} },
                new double[7,2] { {0.014, 3}, {0.043, 1}, {0.057, 1}, {0.100, 1}, {0.157, 1}, {0.186, 1}, {0.414, 1} },
                new double[7,2] { {0.014, 3}, {0.043, 1}, {0.057, 1}, {0.100, 1}, {0.157, 1}, {0.186, 1}, {0.414, 1} },
                new double[7,2] { {0.014, 3}, {0.043, 1}, {0.057, 1}, {0.100, 1}, {0.157, 1}, {0.186, 1}, {0.414, 1} },
                new double[7,2] { {0.014, 3}, {0.043, 1}, {0.057, 1}, {0.100, 1}, {0.157, 1}, {0.186, 1}, {0.414, 1} },
                new double[7,2] { {0.014, 3}, {0.043, 1}, {0.057, 1}, {0.100, 1}, {0.157, 1}, {0.186, 1}, {0.414, 1} },
        };
        //массив диапазонов
        int[] diap = new int[11] { 0, 20, 40, 61, 81, 101, 121, 141, 162, 182, 202 };


        public Issled(byte id, string name)
        {
            this.name = name;
            this.id = id;
            

        }

        public string Name
        {
            get { return name; }
            set { name = value; }
        }

        public byte Id
        {
            get { return id; }
            set { id = value; }
        }

        public double[][,] ProbArray
        {
                
            
            get
            {
                return probarray;
            }
        }

        public int[] Diap
        {
            get
            {
                return diap;
            }
        }
        
    }
}
