using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Diploma
{
    class Issled
    {
        //имя исследования
        string name;
        //id исследования
        byte id;
        //
        private int[][] probamount = new int[18][]
        {
            new int[7] {3,1,1,1,1,1,1},//ПТИ
            new int[7] {3,1,1,1,1,1,1},//К, Na
            new int[9] {2,1,1,1,1,1,1,1,1},//СРБ, АСО
            new int[7] {3,1,1,1,1,2,1},//Глюкоза
            new int[8] {2,1,1,1,1,1,1,1},//Холестерин
            new int[8] {1,1,2,1,2,1,1,1},//Бетта-липопротеиды,триглицириды
            new int[7] {1,1,1,1,1,1,1},//ЛПНП,ЛПВП
            new int[7] {3,1,1,1,1,1,1},//
            new int[7] {3,1,1,1,1,2,1},//
            new int[7] {3,1,1,1,1,1,1},//
            new int[7] {2,1,1,1,2,2,1},//Тимоловая
            new int[5] {2,2,1,2,2},//Мочев, креат
            new int[8] {1,1,1,1,1,1,3,1},//Общ бел
            new int[7] {1,2,1,2,1,2,1},//Fe, жсс
            new int[7] {2,1,1,1,2,2,1},//
            new int[7] {3,1,1,1,1,1,1},//
            new int[7] {3,1,1,1,1,1,1},//
            new int[7] {1,2,1,2,1,2,1},//
        };
        //массив вероятностей исследования
        private double[][] probarray = new double[18][]
        {
            //массив значений для подсчета кумулятивной вероятности
                new double[7] { 0.014, 0.043, 0.057, 0.100, 0.157, 0.186, 0.414 },//ПТИ
                new double[7] { 0.014, 0.043, 0.057, 0.100, 0.214, 0.229, 0.271 },//К, Na
                new double[9] { 0.014, 0.043, 0.057, 0.071, 0.114, 0.143, 0.157, 0.186, 0.200 },//СРБ,АСО
                new double[7] { 0.014, 0.029, 0.057, 0.086, 0.143, 0.200, 0.243 },//Глюкоза
                new double[8] { 0.014, 0.029, 0.043, 0.129, 0.143, 0.157, 0.200, 0.271 },//Холестерин
                new double[8] { 0.014, 0.029, 0.057, 0.071, 0.114, 0.143, 0.157, 0.243 },//Бетта-липопротеиды,триглицириды
                new double[7] { 0.014, 0.029, 0.043, 0.071, 0.086, 0.286, 0.471 },//ЛПНП,ЛПВП
                new double[7] { 0.014, 0.043, 0.057, 0.100, 0.157, 0.186, 0.414 },//---
                new double[7] { 0.014, 0.043, 0.057, 0.100, 0.157, 0.186, 0.414 },//---
                new double[7] { 0.014, 0.043, 0.057, 0.100, 0.157, 0.186, 0.414 },//---
                new double[7] { 0.014, 0.057, 0.071, 0.100, 0.129, 0.143, 0.200 },//Тимоловая
                new double[5] { 0.029, 0.057, 0.114, 0.157, 0.200 },//Мочев,креат
                new double[8] { 0.014, 0.029, 0.043, 0.057, 0.071, 0.143, 0.157, 0.171 },//Общ бел
                new double[7] { 0.014, 0.029, 0.071, 0.100, 0.114, 0.157, 0.229 },//Fe,жсс
                new double[7] { 0.014, 0.029, 0.071, 0.157, 0.186, 0.229, 0.300 },//Альфа амил
                new double[7] { 0.014, 0.043, 0.057, 0.100, 0.157, 0.186, 0.414 },//---
                new double[7] { 0.014, 0.043, 0.057, 0.100, 0.157, 0.186, 0.414 },//---
                new double[7] { 0.014, 0.043, 0.057, 0.100, 0.157, 0.186, 0.414 },//---
        };
        //массив диапазонов
        int[][] diap = new int[18][]
        {
            new int[11] {0, 21, 41, 62, 82, 102, 122, 142, 163, 183, 203},//ПТИ
            new int[11] {0, 6, 11, 16, 21, 25, 30, 35, 40, 45, 49},//К, Na
            new int[11] {0, 5, 8, 13, 17, 21, 24, 28, 32, 36, 39},//СРБ,АСО
            new int[11] {0, 37, 73, 108, 144, 102, 122, 142, 163, 183, 203},//Глюкоза
            new int[11] {15, 49, 81, 113, 145, 177, 209, 241, 273, 305, 337},//Холестерин
            new int[11] {0, 15, 29, 43, 57, 70, 84, 98, 112, 126, 139},//Бетта-липопротеиды,триглицириды
            new int[11] {0, 6, 11, 16, 20, 25, 30, 34, 39, 44, 48},//ЛПНП,ЛПВП
            new int[11] {0, 21, 41, 62, 82, 102, 122, 142, 163, 183, 203},
            new int[11] {0, 21, 41, 62, 82, 102, 122, 142, 163, 183, 203},
            new int[11] {0, 21, 41, 62, 82, 102, 122, 142, 163, 183, 203},
            new int[11] {0, 21, 41, 62, 82, 102, 122, 142, 163, 183, 203},
            new int[11] {0, 21, 41, 62, 82, 102, 122, 142, 163, 183, 203},
            new int[11] {0, 21, 41, 62, 82, 102, 122, 142, 163, 183, 203},
            new int[11] {0, 21, 41, 62, 82, 102, 122, 142, 163, 183, 203},
            new int[11] {0, 21, 41, 62, 82, 102, 122, 142, 163, 183, 203},
            new int[11] {0, 21, 41, 62, 82, 102, 122, 142, 163, 183, 203},
            new int[11] {0, 21, 41, 62, 82, 102, 122, 142, 163, 183, 203},
            new int[11] {0, 21, 41, 62, 82, 102, 122, 142, 163, 183, 203},

        };


        public Issled(byte id, string name)
        {
            this.name = name;
            this.id = id;
            

        }

        public string Name
        {
            get { return name; }
            set { name = value; }
        }

        public byte Id
        {
            get { return id; }
            set { id = value; }
        }

        public double[][] ProbArray
        {
                
            
            get
            {
                return probarray;
            }
        }

        public int[][] Diap
        {
            get
            {
                return diap;
            }
        }

        public int[][] ProbAmount
        {
            get
            {
                return probamount;
            }
        }
        
    }
}
